terratest log

<details><summary>Show Log</summary>

```log
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:48+07:00 logger.go:66:
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:48+07:00 logger.go:66: You may now begin working with Terraform. Try running "terraform plan" to see
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:48+07:00 logger.go:66: any changes that are required for your infrastructure. All Terraform commands
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:48+07:00 logger.go:66: should now work.
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:48+07:00 logger.go:66:
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:48+07:00 logger.go:66: If you ever set or change modules or backend configuration for Terraform,
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:48+07:00 logger.go:66: rerun this command to reinitialize your working directory. If you forget, other
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:48+07:00 logger.go:66: commands will detect it and remind you to do so if necessary.
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:48+07:00 retry.go:91: terraform [apply -input=false -auto-approve -lock=false]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:48+07:00 logger.go:66: Running command terraform with args [apply -input=false -auto-approve -lock=false]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66: Terraform used the selected providers to generate the following execution
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66: plan. Resource actions are indicated with the following symbols:
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:   + create
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66: Terraform will perform the following actions:
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:   # random_id.instance_suffix will be created
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:   + resource "random_id" "instance_suffix" {
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:       + b64_std     = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:       + b64_url     = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:       + byte_length = 4
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:       + dec         = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:       + hex         = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:       + id          = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:     }
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:   # random_id.random_string will be created
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:   + resource "random_id" "random_string" {
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:       + b64_std     = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:       + b64_url     = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:       + byte_length = 12
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:       + dec         = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:       + hex         = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:       + id          = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:     }
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:   # module.test_sql_database_1.google_sql_database.database will be created
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:   + resource "google_sql_database" "database" {
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:       + collation = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:       + id        = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:       + instance  = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:       + name      = "db-first"
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:       + project   = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:       + self_link = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:     }
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:   # module.test_sql_database_2.google_sql_database.database will be created
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:   + resource "google_sql_database" "database" {
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:       + collation = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:       + id        = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:       + instance  = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:       + name      = "db-second"
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:       + project   = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:       + self_link = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:     }
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:   # module.test_sql_database_instance.google_sql_database_instance.instance will be created
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:   + resource "google_sql_database_instance" "instance" {
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:       + connection_name               = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:       + database_version              = "MYSQL_8_0"
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:       + deletion_protection           = false
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:       + first_ip_address              = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:       + id                            = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:       + ip_address                    = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:       + master_instance_name          = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:       + name                          = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:       + private_ip_address            = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:       + project                       = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:       + public_ip_address             = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:       + region                        = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:       + self_link                     = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:       + server_ca_cert                = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:       + service_account_email_address = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:       + replica_configuration {
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:           + ca_certificate            = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:           + client_certificate        = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:           + client_key                = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:           + connect_retry_interval    = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:           + dump_file_path            = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:           + failover_target           = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:           + master_heartbeat_period   = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:           + password                  = (sensitive value)
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:           + ssl_cipher                = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:           + username                  = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:           + verify_server_certificate = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:         }
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:       + settings {
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:           + activation_policy     = "ALWAYS"
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:           + availability_type     = "ZONAL"
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:           + disk_autoresize       = true
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:           + disk_autoresize_limit = 20
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:           + disk_size             = 10
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:           + disk_type             = "PD_SSD"
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:           + pricing_plan          = "PER_USE"
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:           + tier                  = "db-f1-micro"
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:           + user_labels           = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:           + version               = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:           + backup_configuration {
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:               + binary_log_enabled             = true
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:               + enabled                        = true
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:               + start_time                     = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:               + transaction_log_retention_days = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:               + backup_retention_settings {
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:                   + retained_backups = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:                   + retention_unit   = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:                 }
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:             }
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:           + ip_configuration {
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:               + ipv4_enabled = true
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:               + require_ssl  = true
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:             }
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:           + location_preference {
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:               + follow_gae_application = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:               + zone                   = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:             }
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:         }
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:     }
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:   # module.test_sql_user.google_sql_user.users will be created
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:   + resource "google_sql_user" "users" {
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:       + host     = "localhost"
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:       + id       = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:       + instance = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:       + name     = "sql-user"
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:       + password = (sensitive value)
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:       + project  = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:     }
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66: Plan: 6 to add, 0 to change, 0 to destroy.
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66: Changes to Outputs:
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:   + random_string                                            = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:   + test_sql_database_1_id                                   = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:   + test_sql_database_1_self_link                            = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:   + test_sql_database_2_id                                   = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:   + test_sql_database_2_self_link                            = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:   + test_sql_database_instance_private_ip_private_ip_address = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:   + test_sql_database_instance_private_ip_public_ip_address  = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:   + test_sql_user_name                                       = "sql-user"
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:   + test_sql_user_password                                   = (sensitive value)
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:   + test_terraform_sql_connection_name                       = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:   + test_terraform_sql_first_ip_address                      = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:   + test_terraform_sql_instance_name                         = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:   + test_terraform_sql_self_link                             = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66:   + test_terraform_sql_service_account_email_address         = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66: random_id.instance_suffix: Creating...
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66: random_id.random_string: Creating...
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66: random_id.instance_suffix: Creation complete after 0s [id=CnsIgA]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66: random_id.random_string: Creation complete after 0s [id=zD174B-AZ0bRuPfK]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:26:51+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Creating...
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:27:01+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [10s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:27:11+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [20s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:27:21+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [30s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:27:31+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [40s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:27:41+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [50s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:27:51+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [1m0s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:28:01+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [1m10s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:28:11+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [1m20s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:28:21+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [1m30s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:28:31+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [1m40s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:28:41+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [1m50s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:28:51+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [2m0s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:29:01+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [2m10s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:29:11+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [2m20s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:29:21+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [2m30s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:29:31+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [2m40s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:29:41+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [2m50s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:29:51+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [3m0s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:30:01+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [3m10s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:30:11+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [3m20s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:30:21+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [3m30s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:30:31+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [3m40s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:30:41+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [3m50s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:30:51+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [4m0s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:31:01+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [4m10s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:31:11+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [4m20s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:31:21+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [4m30s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:31:31+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [4m40s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:31:41+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [4m50s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:31:51+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [5m0s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:32:01+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [5m10s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:32:11+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [5m20s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:32:21+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [5m30s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:32:31+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [5m40s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:32:41+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [5m50s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:32:51+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [6m0s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:33:01+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [6m10s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:33:11+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [6m20s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:33:21+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [6m30s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:33:31+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [6m40s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:33:41+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [6m50s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:33:51+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [7m0s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:34:01+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [7m10s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:34:11+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [7m20s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:34:21+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [7m30s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:34:31+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [7m40s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:34:41+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [7m50s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:34:51+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [8m0s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:35:01+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [8m10s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:35:11+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [8m20s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:35:21+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [8m30s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:35:31+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [8m40s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:35:41+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [8m50s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:35:51+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [9m0s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:36:01+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [9m10s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:36:11+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [9m20s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:36:21+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [9m30s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:36:31+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [9m40s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:36:41+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [9m50s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:36:51+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [10m0s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:37:01+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [10m10s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:37:11+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [10m20s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:37:21+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [10m30s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:37:31+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [10m40s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:37:41+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [10m50s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:37:51+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [11m0s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:38:01+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [11m10s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:38:11+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [11m20s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:38:21+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [11m30s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:38:31+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [11m40s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:38:41+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [11m50s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:38:51+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [12m0s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:39:01+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [12m10s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:39:11+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [12m20s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:39:21+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [12m30s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:39:31+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [12m40s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:39:41+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [12m50s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:39:51+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [13m0s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:40:01+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [13m10s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:40:11+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [13m20s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:40:21+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [13m30s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:40:31+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [13m40s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:40:41+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [13m50s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:40:45+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Creation complete after 13m53s [id=sql-instance-0a7b0880]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:40:45+07:00 logger.go:66: module.test_sql_database_2.google_sql_database.database: Creating...
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:40:45+07:00 logger.go:66: module.test_sql_user.google_sql_user.users: Creating...
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:40:45+07:00 logger.go:66: module.test_sql_database_1.google_sql_database.database: Creating...
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:40:49+07:00 logger.go:66: module.test_sql_database_1.google_sql_database.database: Creation complete after 5s [id=projects/test-terraform-project-01/instances/sql-instance-0a7b0880/databases/db-first]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:40:54+07:00 logger.go:66: module.test_sql_database_2.google_sql_database.database: Creation complete after 9s [id=projects/test-terraform-project-01/instances/sql-instance-0a7b0880/databases/db-second]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:40:55+07:00 logger.go:66: module.test_sql_user.google_sql_user.users: Still creating... [10s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:40:57+07:00 logger.go:66: module.test_sql_user.google_sql_user.users: Creation complete after 13s [id=sql-user/localhost/sql-instance-0a7b0880]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:40:57+07:00 logger.go:66:
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:40:57+07:00 logger.go:66: Apply complete! Resources: 6 added, 0 changed, 0 destroyed.
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:40:57+07:00 logger.go:66:
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:40:57+07:00 logger.go:66: Outputs:
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:40:57+07:00 logger.go:66:
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:40:57+07:00 logger.go:66: random_string = "cc3d7be01f806746d1b8f7ca"
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:40:57+07:00 logger.go:66: test_sql_database_1_id = "projects/test-terraform-project-01/instances/sql-instance-0a7b0880/databases/db-first"
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:40:57+07:00 logger.go:66: test_sql_database_1_self_link = "https://sqladmin.googleapis.com/sql/v1beta4/projects/test-terraform-project-01/instances/sql-instance-0a7b0880/databases/db-first"
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:40:57+07:00 logger.go:66: test_sql_database_2_id = "projects/test-terraform-project-01/instances/sql-instance-0a7b0880/databases/db-second"
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:40:57+07:00 logger.go:66: test_sql_database_2_self_link = "https://sqladmin.googleapis.com/sql/v1beta4/projects/test-terraform-project-01/instances/sql-instance-0a7b0880/databases/db-second"
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:40:57+07:00 logger.go:66: test_sql_database_instance_private_ip_private_ip_address = ""
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:40:57+07:00 logger.go:66: test_sql_database_instance_private_ip_public_ip_address = "34.101.82.172"
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:40:57+07:00 logger.go:66: test_sql_user_name = "sql-user"
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:40:57+07:00 logger.go:66: test_sql_user_password = <sensitive>
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:40:57+07:00 logger.go:66: test_terraform_sql_connection_name = "test-terraform-project-01:asia-southeast2:sql-instance-0a7b0880"
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:40:57+07:00 logger.go:66: test_terraform_sql_first_ip_address = "34.101.82.172"
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:40:57+07:00 logger.go:66: test_terraform_sql_instance_name = "sql-instance-0a7b0880"
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:40:57+07:00 logger.go:66: test_terraform_sql_self_link = "https://sqladmin.googleapis.com/sql/v1beta4/projects/test-terraform-project-01/instances/sql-instance-0a7b0880"
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:40:57+07:00 logger.go:66: test_terraform_sql_service_account_email_address = "p434072338061-j6bk4u@gcp-sa-cloud-sql.iam.gserviceaccount.com"
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:40:57+07:00 retry.go:91: terraform [output -no-color -json random_string]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:40:57+07:00 logger.go:66: Running command terraform with args [output -no-color -json random_string]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:40:58+07:00 logger.go:66: "cc3d7be01f806746d1b8f7ca"
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:40:58+07:00 retry.go:91: terraform [output -no-color -json test_terraform_sql_instance_name]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:40:58+07:00 logger.go:66: Running command terraform with args [output -no-color -json test_terraform_sql_instance_name]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:40:58+07:00 logger.go:66: "sql-instance-0a7b0880"
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:40:58+07:00 retry.go:91: terraform [output -no-color -json test_terraform_sql_self_link]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:40:58+07:00 logger.go:66: Running command terraform with args [output -no-color -json test_terraform_sql_self_link]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:40:58+07:00 logger.go:66: "https://sqladmin.googleapis.com/sql/v1beta4/projects/test-terraform-project-01/instances/sql-instance-0a7b0880"
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:40:58+07:00 retry.go:91: terraform [output -no-color -json test_terraform_sql_service_account_email_address]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:40:58+07:00 logger.go:66: Running command terraform with args [output -no-color -json test_terraform_sql_service_account_email_address]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:40:58+07:00 logger.go:66: "p434072338061-j6bk4u@gcp-sa-cloud-sql.iam.gserviceaccount.com"
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:40:58+07:00 retry.go:91: terraform [output -no-color -json test_terraform_sql_connection_name]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:40:58+07:00 logger.go:66: Running command terraform with args [output -no-color -json test_terraform_sql_connection_name]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:40:59+07:00 logger.go:66: "test-terraform-project-01:asia-southeast2:sql-instance-0a7b0880"
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:40:59+07:00 retry.go:91: terraform [output -no-color -json test_sql_user_name]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:40:59+07:00 logger.go:66: Running command terraform with args [output -no-color -json test_sql_user_name]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:40:59+07:00 logger.go:66: "sql-user"
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:40:59+07:00 retry.go:91: terraform [output -no-color -json test_sql_database_1_id]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:40:59+07:00 logger.go:66: Running command terraform with args [output -no-color -json test_sql_database_1_id]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:40:59+07:00 logger.go:66: "projects/test-terraform-project-01/instances/sql-instance-0a7b0880/databases/db-first"
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:40:59+07:00 retry.go:91: terraform [output -no-color -json test_sql_database_2_id]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:40:59+07:00 logger.go:66: Running command terraform with args [output -no-color -json test_sql_database_2_id]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:00+07:00 logger.go:66: "projects/test-terraform-project-01/instances/sql-instance-0a7b0880/databases/db-second"
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:00+07:00 retry.go:91: terraform [output -no-color -json test_sql_database_instance_private_ip_public_ip_address]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:00+07:00 logger.go:66: Running command terraform with args [output -no-color -json test_sql_database_instance_private_ip_public_ip_address]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:00+07:00 logger.go:66: "34.101.82.172"
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:00+07:00 retry.go:91: terraform [output -no-color -json test_sql_database_instance_private_ip_private_ip_address]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:00+07:00 logger.go:66: Running command terraform with args [output -no-color -json test_sql_database_instance_private_ip_private_ip_address]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:00+07:00 logger.go:66: ""
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:00+07:00 retry.go:91: terraform [destroy -auto-approve -input=false -lock=false]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:00+07:00 logger.go:66: Running command terraform with args [destroy -auto-approve -input=false -lock=false]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:01+07:00 logger.go:66: random_id.random_string: Refreshing state... [id=zD174B-AZ0bRuPfK]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:01+07:00 logger.go:66: random_id.instance_suffix: Refreshing state... [id=CnsIgA]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:02+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Refreshing state... [id=sql-instance-0a7b0880]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:02+07:00 logger.go:66: module.test_sql_user.google_sql_user.users: Refreshing state... [id=sql-user/localhost/sql-instance-0a7b0880]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:02+07:00 logger.go:66: module.test_sql_database_1.google_sql_database.database: Refreshing state... [id=projects/test-terraform-project-01/instances/sql-instance-0a7b0880/databases/db-first]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:02+07:00 logger.go:66: module.test_sql_database_2.google_sql_database.database: Refreshing state... [id=projects/test-terraform-project-01/instances/sql-instance-0a7b0880/databases/db-second]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66: Terraform used the selected providers to generate the following execution
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66: plan. Resource actions are indicated with the following symbols:
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:   - destroy
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66: Terraform will perform the following actions:
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:   # random_id.instance_suffix will be destroyed
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:   - resource "random_id" "instance_suffix" {
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:       - b64_std     = "CnsIgA==" -> null
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:       - b64_url     = "CnsIgA" -> null
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:       - byte_length = 4 -> null
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:       - dec         = "175835264" -> null
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:       - hex         = "0a7b0880" -> null
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:       - id          = "CnsIgA" -> null
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:     }
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:   # random_id.random_string will be destroyed
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:   - resource "random_id" "random_string" {
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:       - b64_std     = "zD174B+AZ0bRuPfK" -> null
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:       - b64_url     = "zD174B-AZ0bRuPfK" -> null
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:       - byte_length = 12 -> null
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:       - dec         = "63209271463968879642871920586" -> null
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:       - hex         = "cc3d7be01f806746d1b8f7ca" -> null
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:       - id          = "zD174B-AZ0bRuPfK" -> null
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:     }
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:   # module.test_sql_database_1.google_sql_database.database will be destroyed
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:   - resource "google_sql_database" "database" {
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:       - charset   = "utf8mb4" -> null
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:       - collation = "utf8mb4_0900_ai_ci" -> null
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:       - id        = "projects/test-terraform-project-01/instances/sql-instance-0a7b0880/databases/db-first" -> null
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:       - instance  = "sql-instance-0a7b0880" -> null
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:       - name      = "db-first" -> null
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:       - project   = "test-terraform-project-01" -> null
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:       - self_link = "https://sqladmin.googleapis.com/sql/v1beta4/projects/test-terraform-project-01/instances/sql-instance-0a7b0880/databases/db-first" -> null
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:     }
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:   # module.test_sql_database_2.google_sql_database.database will be destroyed
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:   - resource "google_sql_database" "database" {
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:       - charset   = "utf8mb4" -> null
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:       - collation = "utf8mb4_0900_ai_ci" -> null
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:       - id        = "projects/test-terraform-project-01/instances/sql-instance-0a7b0880/databases/db-second" -> null
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:       - instance  = "sql-instance-0a7b0880" -> null
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:       - name      = "db-second" -> null
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:       - project   = "test-terraform-project-01" -> null
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:       - self_link = "https://sqladmin.googleapis.com/sql/v1beta4/projects/test-terraform-project-01/instances/sql-instance-0a7b0880/databases/db-second" -> null
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:     }
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:   # module.test_sql_database_instance.google_sql_database_instance.instance will be destroyed
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:   - resource "google_sql_database_instance" "instance" {
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:       - connection_name               = "test-terraform-project-01:asia-southeast2:sql-instance-0a7b0880" -> null
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:       - database_version              = "MYSQL_8_0" -> null
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:       - deletion_protection           = false -> null
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:       - first_ip_address              = "34.101.82.172" -> null
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:       - id                            = "sql-instance-0a7b0880" -> null
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:       - ip_address                    = [
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:           - {
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:               - ip_address     = "34.101.82.172"
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:               - time_to_retire = ""
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:               - type           = "PRIMARY"
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:             },
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:         ] -> null
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:       - name                          = "sql-instance-0a7b0880" -> null
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:       - project                       = "test-terraform-project-01" -> null
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:       - public_ip_address             = "34.101.82.172" -> null
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:       - region                        = "asia-southeast2" -> null
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:       - self_link                     = "https://sqladmin.googleapis.com/sql/v1beta4/projects/test-terraform-project-01/instances/sql-instance-0a7b0880" -> null
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:       - server_ca_cert                = [
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:           - {
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:               - cert             = <<-EOT
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:                     -----BEGIN CERTIFICATE-----
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:                     MIIDfzCCAmegAwIBAgIBADANBgkqhkiG9w0BAQsFADB3MS0wKwYDVQQuEyRiYWE3
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:                     YzkxNy03M2YxLTQ5NWUtOTY2ZS1lOTVmNDVjYzdjMjIxIzAhBgNVBAMTGkdvb2ds
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:                     ZSBDbG91ZCBTUUwgU2VydmVyIENBMRQwEgYDVQQKEwtHb29nbGUsIEluYzELMAkG
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:                     A1UEBhMCVVMwHhcNMjIwMzIxMTcyNzE4WhcNMzIwMzE4MTcyODE4WjB3MS0wKwYD
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:                     VQQuEyRiYWE3YzkxNy03M2YxLTQ5NWUtOTY2ZS1lOTVmNDVjYzdjMjIxIzAhBgNV
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:                     BAMTGkdvb2dsZSBDbG91ZCBTUUwgU2VydmVyIENBMRQwEgYDVQQKEwtHb29nbGUs
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:                     IEluYzELMAkGA1UEBhMCVVMwggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEKAoIB
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:                     AQCgKisj1ppMEIwEb6A3behdy13sDUjYx0gA5uxRuzxKjF2Kc4qzWT3AFFAMa/xK
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:                     TwuYq/2RQTenWYhqDcs7Bc2xRPGUjmsCVIrdW5ZVOhR3fjkLh2a1Sn0E/TLaPAQX
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:                     I5aAdXgdjS+PAmksJjFoYM/PmROiFeKqsP3Nz9VBJUbh0Nto7dygZ/LZqlgZlncn
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:                     qY0ogKFc1zHUuEJhuY9jZDdscywjjvNiOd3Zl2i6dJ60cnEciawSSuu5OpCAEOdX
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:                     InIlgI8dg/qN4K5TiUXQDu2/CyStUPswfNja44Gw4O900iU19d+ccvyqZ9E7/VLH
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:                     EXZDSsYPf8pRmirNFuJfbkzdAgMBAAGjFjAUMBIGA1UdEwEB/wQIMAYBAf8CAQAw
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:                     DQYJKoZIhvcNAQELBQADggEBAAIEBkqQ2F8B8m1/km4c+7XdG3AlWMtQ77Kkw354
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:                     i0rPrTKDoI24L13m30mUIDYSqK5K6nNudmR04pWeJGJDEZXUpPra3L0QywEK9eRD
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:                     3iFBEyyS6OYSHLrXIrN5gUg7ISbQI//H7IDbIgmxl11q3AhOP2+zzjxlUNes7jEl
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:                     w6b54l3TvoOsB1FfuFfsaPN+fMBzquGojVLX1An74J+Z4Puzfq2tOnkJ5/k+ILM5
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:                     KO77iHfGG5X4Temh9NyoiLNwrbT9Cv8iNbepAR5dtrKzvwQEU//JwaD//vAIVEFx
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:                     kdJFxI+LP3B7b/10T2D4Ed/HuKlL9hV0TD02BJbBOC53h8M=
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:                     -----END CERTIFICATE-----
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:                 EOT
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:               - common_name      = "C=US,O=Google\\, Inc,CN=Google Cloud SQL Server CA,dnQualifier=baa7c917-73f1-495e-966e-e95f45cc7c22"
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:               - create_time      = "2022-03-21T17:27:18.493Z"
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:               - expiration_time  = "2032-03-18T17:28:18.493Z"
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:               - sha1_fingerprint = "9655eeb26c991e1aaf1c9f02ae6b05ddc91658c8"
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:             },
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:         ] -> null
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:       - service_account_email_address = "p434072338061-j6bk4u@gcp-sa-cloud-sql.iam.gserviceaccount.com" -> null
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:       - settings {
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:           - activation_policy     = "ALWAYS" -> null
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:           - availability_type     = "ZONAL" -> null
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:           - disk_autoresize       = true -> null
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:           - disk_autoresize_limit = 20 -> null
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:           - disk_size             = 10 -> null
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:           - disk_type             = "PD_SSD" -> null
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:           - pricing_plan          = "PER_USE" -> null
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:           - tier                  = "db-f1-micro" -> null
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:           - user_labels           = {} -> null
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:           - version               = 1 -> null
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:           - backup_configuration {
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:               - binary_log_enabled             = true -> null
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:               - enabled                        = true -> null
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:               - point_in_time_recovery_enabled = false -> null
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:               - start_time                     = "15:00" -> null
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:               - transaction_log_retention_days = 7 -> null
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:               - backup_retention_settings {
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:                   - retained_backups = 7 -> null
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:                   - retention_unit   = "COUNT" -> null
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:                 }
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:             }
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:           - ip_configuration {
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:               - ipv4_enabled = true -> null
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:               - require_ssl  = true -> null
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:             }
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:           - location_preference {
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:               - zone = "asia-southeast2-b" -> null
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:             }
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:         }
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:     }
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:   # module.test_sql_user.google_sql_user.users will be destroyed
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:   - resource "google_sql_user" "users" {
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:       - host     = "localhost" -> null
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:       - id       = "sql-user/localhost/sql-instance-0a7b0880" -> null
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:       - instance = "sql-instance-0a7b0880" -> null
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:       - name     = "sql-user" -> null
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:       - password = (sensitive value)
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:       - project  = "test-terraform-project-01" -> null
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:     }
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66: Plan: 0 to add, 0 to change, 6 to destroy.
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66: Changes to Outputs:
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:   - random_string                                           = "cc3d7be01f806746d1b8f7ca" -> null
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:   - test_sql_database_1_id                                  = "projects/test-terraform-project-01/instances/sql-instance-0a7b0880/databases/db-first" -> null
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:   - test_sql_database_1_self_link                           = "https://sqladmin.googleapis.com/sql/v1beta4/projects/test-terraform-project-01/instances/sql-instance-0a7b0880/databases/db-first" -> null
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:   - test_sql_database_2_id                                  = "projects/test-terraform-project-01/instances/sql-instance-0a7b0880/databases/db-second" -> null
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:   - test_sql_database_2_self_link                           = "https://sqladmin.googleapis.com/sql/v1beta4/projects/test-terraform-project-01/instances/sql-instance-0a7b0880/databases/db-second" -> null
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:   - test_sql_database_instance_private_ip_public_ip_address = "34.101.82.172" -> null
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:   - test_sql_user_name                                      = "sql-user" -> null
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:   - test_sql_user_password                                  = (sensitive value)
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:   - test_terraform_sql_connection_name                      = "test-terraform-project-01:asia-southeast2:sql-instance-0a7b0880" -> null
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:   - test_terraform_sql_first_ip_address                     = "34.101.82.172" -> null
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:   - test_terraform_sql_instance_name                        = "sql-instance-0a7b0880" -> null
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:   - test_terraform_sql_self_link                            = "https://sqladmin.googleapis.com/sql/v1beta4/projects/test-terraform-project-01/instances/sql-instance-0a7b0880" -> null
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:06+07:00 logger.go:66:   - test_terraform_sql_service_account_email_address        = "p434072338061-j6bk4u@gcp-sa-cloud-sql.iam.gserviceaccount.com" -> null
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:07+07:00 logger.go:66: module.test_sql_database_2.google_sql_database.database: Destroying... [id=projects/test-terraform-project-01/instances/sql-instance-0a7b0880/databases/db-second]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:07+07:00 logger.go:66: module.test_sql_user.google_sql_user.users: Destroying... [id=sql-user/localhost/sql-instance-0a7b0880]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:07+07:00 logger.go:66: module.test_sql_database_1.google_sql_database.database: Destroying... [id=projects/test-terraform-project-01/instances/sql-instance-0a7b0880/databases/db-first]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:10+07:00 logger.go:66: module.test_sql_user.google_sql_user.users: Destruction complete after 3s
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:10+07:00 logger.go:66: random_id.random_string: Destroying... [id=zD174B-AZ0bRuPfK]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:10+07:00 logger.go:66: random_id.random_string: Destruction complete after 0s
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:11+07:00 logger.go:66: module.test_sql_database_2.google_sql_database.database: Destruction complete after 4s
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:12+07:00 logger.go:66: module.test_sql_database_1.google_sql_database.database: Destruction complete after 5s
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:12+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Destroying... [id=sql-instance-0a7b0880]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:22+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still destroying... [id=sql-instance-0a7b0880, 10s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:32+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still destroying... [id=sql-instance-0a7b0880, 20s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:42+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still destroying... [id=sql-instance-0a7b0880, 30s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:41:52+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still destroying... [id=sql-instance-0a7b0880, 40s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:42:02+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still destroying... [id=sql-instance-0a7b0880, 50s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:42:12+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still destroying... [id=sql-instance-0a7b0880, 1m0s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:42:22+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still destroying... [id=sql-instance-0a7b0880, 1m10s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:42:32+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still destroying... [id=sql-instance-0a7b0880, 1m20s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:42:42+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still destroying... [id=sql-instance-0a7b0880, 1m30s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:42:46+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Destruction complete after 1m33s
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:42:46+07:00 logger.go:66: random_id.instance_suffix: Destroying... [id=CnsIgA]
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:42:46+07:00 logger.go:66: random_id.instance_suffix: Destruction complete after 0s
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:42:46+07:00 logger.go:66:
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:42:46+07:00 logger.go:66: Destroy complete! Resources: 6 destroyed.
TestTerraformCreateGCPSQL/create_mysql_with_public_ip 2022-03-22T00:42:46+07:00 logger.go:66:
=== RUN   TestTerraformCreateGCPSQL/create_mysql_with_private_ip
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:46+07:00 test_structure.go:130: Copied terraform folder ../examples/create_mysql_instance_with_private_ip to /var/folders/tg/hg1rc57d34nd17njqn__zry40000gn/T/create_mysql_with_private_ip1598281323/terraform-gcp-sql/examples/create_mysql_instance_with_private_ip
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:46+07:00 retry.go:91: terraform [init -upgrade=false]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:46+07:00 logger.go:66: Running command terraform with args [init -upgrade=false]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:46+07:00 logger.go:66: Initializing modules...
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:46+07:00 logger.go:66: - google_compute_global_address_private_ip_address in ../../modules/google_compute_global_address
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:46+07:00 logger.go:66: - google_compute_network_private_network in ../../modules/google_compute_network
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:46+07:00 logger.go:66: - google_service_networking_connection_private_vpc_connection in ../../modules/google_service_networking_connection
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:46+07:00 logger.go:66: - test_sql_database in ../../modules/google_sql_database
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:46+07:00 logger.go:66: - test_sql_database_instance_private_ip in ../../modules/google_sql_database_instance
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:46+07:00 logger.go:66: - test_sql_user in ../../modules/google_sql_user
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:46+07:00 logger.go:66:
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:46+07:00 logger.go:66: Initializing the backend...
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:46+07:00 logger.go:66:
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:46+07:00 logger.go:66: Initializing provider plugins...
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:46+07:00 logger.go:66: - Finding latest version of hashicorp/random...
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:47+07:00 logger.go:66: - Finding hashicorp/google versions matching "4.14.0"...
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:47+07:00 logger.go:66: - Finding latest version of hashicorp/google-beta...
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:48+07:00 logger.go:66: - Installing hashicorp/google v4.14.0...
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:49+07:00 logger.go:66: - Installed hashicorp/google v4.14.0 (signed by HashiCorp)
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:49+07:00 logger.go:66: - Installing hashicorp/google-beta v4.14.0...
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:51+07:00 logger.go:66: - Installed hashicorp/google-beta v4.14.0 (signed by HashiCorp)
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:51+07:00 logger.go:66: - Installing hashicorp/random v3.1.2...
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:52+07:00 logger.go:66: - Installed hashicorp/random v3.1.2 (signed by HashiCorp)
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:52+07:00 logger.go:66:
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:52+07:00 logger.go:66: Terraform has created a lock file .terraform.lock.hcl to record the provider
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:52+07:00 logger.go:66: selections it made above. Include this file in your version control repository
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:52+07:00 logger.go:66: so that Terraform can guarantee to make the same selections by default when
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:52+07:00 logger.go:66: you run "terraform init" in the future.
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:52+07:00 logger.go:66:
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:52+07:00 logger.go:66: Terraform has been successfully initialized!
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:52+07:00 logger.go:66:
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:52+07:00 logger.go:66: You may now begin working with Terraform. Try running "terraform plan" to see
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:52+07:00 logger.go:66: any changes that are required for your infrastructure. All Terraform commands
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:52+07:00 logger.go:66: should now work.
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:52+07:00 logger.go:66:
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:52+07:00 logger.go:66: If you ever set or change modules or backend configuration for Terraform,
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:52+07:00 logger.go:66: rerun this command to reinitialize your working directory. If you forget, other
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:52+07:00 logger.go:66: commands will detect it and remind you to do so if necessary.
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:52+07:00 retry.go:91: terraform [apply -input=false -auto-approve -lock=false]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:52+07:00 logger.go:66: Running command terraform with args [apply -input=false -auto-approve -lock=false]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66: Terraform used the selected providers to generate the following execution
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66: plan. Resource actions are indicated with the following symbols:
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:   + create
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66: Terraform will perform the following actions:
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:   # random_id.instance_suffix will be created
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:   + resource "random_id" "instance_suffix" {
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:       + b64_std     = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:       + b64_url     = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:       + byte_length = 4
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:       + dec         = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:       + hex         = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:       + id          = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:     }
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:   # random_id.random_string will be created
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:   + resource "random_id" "random_string" {
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:       + b64_std     = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:       + b64_url     = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:       + byte_length = 12
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:       + dec         = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:       + hex         = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:       + id          = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:     }
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:   # module.google_compute_global_address_private_ip_address.google_compute_global_address.default_network will be created
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:   + resource "google_compute_global_address" "default_network" {
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:       + address            = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:       + address_type       = "INTERNAL"
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:       + creation_timestamp = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:       + id                 = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:       + name               = "private-ip-address"
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:       + network            = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:       + prefix_length      = 16
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:       + project            = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:       + purpose            = "VPC_PEERING"
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:       + self_link          = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:     }
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:   # module.google_compute_network_private_network.google_compute_network.vpc_network will be created
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:   + resource "google_compute_network" "vpc_network" {
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:       + auto_create_subnetworks         = true
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:       + delete_default_routes_on_create = false
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:       + gateway_ipv4                    = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:       + id                              = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:       + mtu                             = 0
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:       + name                            = "private-network"
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:       + project                         = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:       + routing_mode                    = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:       + self_link                       = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:     }
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:   # module.google_service_networking_connection_private_vpc_connection.google_service_networking_connection.network will be created
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:   + resource "google_service_networking_connection" "network" {
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:       + id                      = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:       + network                 = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:       + peering                 = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:       + reserved_peering_ranges = [
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:           + "private-ip-address",
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:         ]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:       + service                 = "servicenetworking.googleapis.com"
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:     }
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:   # module.test_sql_database.google_sql_database.database will be created
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:   + resource "google_sql_database" "database" {
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:       + collation = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:       + id        = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:       + instance  = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:       + name      = "db-first"
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:       + project   = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:       + self_link = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:     }
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:   # module.test_sql_database_instance_private_ip.google_sql_database_instance.instance will be created
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:   + resource "google_sql_database_instance" "instance" {
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:       + connection_name               = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:       + database_version              = "MYSQL_8_0"
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:       + deletion_protection           = false
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:       + first_ip_address              = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:       + id                            = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:       + ip_address                    = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:       + master_instance_name          = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:       + name                          = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:       + private_ip_address            = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:       + project                       = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:       + public_ip_address             = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:       + region                        = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:       + self_link                     = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:       + server_ca_cert                = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:       + service_account_email_address = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:       + replica_configuration {
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:           + ca_certificate            = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:           + client_certificate        = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:           + client_key                = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:           + connect_retry_interval    = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:           + dump_file_path            = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:           + failover_target           = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:           + master_heartbeat_period   = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:           + password                  = (sensitive value)
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:           + ssl_cipher                = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:           + username                  = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:           + verify_server_certificate = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:         }
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:       + settings {
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:           + activation_policy     = "ALWAYS"
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:           + availability_type     = "ZONAL"
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:           + disk_autoresize       = true
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:           + disk_autoresize_limit = 20
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:           + disk_size             = 10
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:           + disk_type             = "PD_SSD"
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:           + pricing_plan          = "PER_USE"
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:           + tier                  = "db-f1-micro"
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:           + user_labels           = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:           + version               = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:           + backup_configuration {
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:               + binary_log_enabled             = true
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:               + enabled                        = true
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:               + start_time                     = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:               + transaction_log_retention_days = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:               + backup_retention_settings {
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:                   + retained_backups = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:                   + retention_unit   = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:                 }
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:             }
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:           + ip_configuration {
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:               + ipv4_enabled    = false
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:               + private_network = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:               + require_ssl     = true
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:             }
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:           + location_preference {
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:               + follow_gae_application = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:               + zone                   = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:             }
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:         }
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:     }
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:   # module.test_sql_user.google_sql_user.users will be created
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:   + resource "google_sql_user" "users" {
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:       + host     = "localhost"
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:       + id       = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:       + instance = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:       + name     = "sql-user"
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:       + password = (sensitive value)
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:       + project  = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:     }
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66: Plan: 8 to add, 0 to change, 0 to destroy.
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66: Changes to Outputs:
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:   + random_string                                                       = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:   + test_sql_database_id                                                = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:   + test_sql_database_instance_private_ip_connection_name               = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:   + test_sql_database_instance_private_ip_first_ip_address              = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:   + test_sql_database_instance_private_ip_instance_name                 = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:   + test_sql_database_instance_private_ip_private_ip_address            = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:   + test_sql_database_instance_private_ip_public_ip_address             = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:   + test_sql_database_instance_private_ip_self_link                     = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:   + test_sql_database_instance_private_ip_service_account_email_address = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:   + test_sql_database_self_link                                         = (known after apply)
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:   + test_sql_user_name                                                  = "sql-user"
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66:   + test_sql_user_password                                              = (sensitive value)
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66: random_id.random_string: Creating...
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66: random_id.instance_suffix: Creating...
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66: random_id.instance_suffix: Creation complete after 0s [id=s0FOzg]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66: random_id.random_string: Creation complete after 0s [id=E2u3sTnJeqttqWes]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:42:56+07:00 logger.go:66: module.google_compute_network_private_network.google_compute_network.vpc_network: Creating...
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:43:06+07:00 logger.go:66: module.google_compute_network_private_network.google_compute_network.vpc_network: Still creating... [10s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:43:16+07:00 logger.go:66: module.google_compute_network_private_network.google_compute_network.vpc_network: Still creating... [20s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:43:26+07:00 logger.go:66: module.google_compute_network_private_network.google_compute_network.vpc_network: Still creating... [30s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:43:36+07:00 logger.go:66: module.google_compute_network_private_network.google_compute_network.vpc_network: Still creating... [40s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:43:40+07:00 logger.go:66: module.google_compute_network_private_network.google_compute_network.vpc_network: Creation complete after 43s [id=projects/test-terraform-project-01/global/networks/private-network]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:43:40+07:00 logger.go:66: module.google_compute_global_address_private_ip_address.google_compute_global_address.default_network: Creating...
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:43:50+07:00 logger.go:66: module.google_compute_global_address_private_ip_address.google_compute_global_address.default_network: Still creating... [10s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:43:52+07:00 logger.go:66: module.google_compute_global_address_private_ip_address.google_compute_global_address.default_network: Creation complete after 12s [id=projects/test-terraform-project-01/global/addresses/private-ip-address]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:43:52+07:00 logger.go:66: module.google_service_networking_connection_private_vpc_connection.google_service_networking_connection.network: Creating...
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:44:02+07:00 logger.go:66: module.google_service_networking_connection_private_vpc_connection.google_service_networking_connection.network: Still creating... [10s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:44:12+07:00 logger.go:66: module.google_service_networking_connection_private_vpc_connection.google_service_networking_connection.network: Still creating... [20s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:44:22+07:00 logger.go:66: module.google_service_networking_connection_private_vpc_connection.google_service_networking_connection.network: Still creating... [30s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:44:32+07:00 logger.go:66: module.google_service_networking_connection_private_vpc_connection.google_service_networking_connection.network: Still creating... [40s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:44:39+07:00 logger.go:66: module.google_service_networking_connection_private_vpc_connection.google_service_networking_connection.network: Creation complete after 46s [id=projects%2Ftest-terraform-project-01%2Fglobal%2Fnetworks%2Fprivate-network:servicenetworking.googleapis.com]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:44:39+07:00 logger.go:66: module.test_sql_database_instance_private_ip.google_sql_database_instance.instance: Creating...
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:44:49+07:00 logger.go:66: module.test_sql_database_instance_private_ip.google_sql_database_instance.instance: Still creating... [10s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:44:59+07:00 logger.go:66: module.test_sql_database_instance_private_ip.google_sql_database_instance.instance: Still creating... [20s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:45:09+07:00 logger.go:66: module.test_sql_database_instance_private_ip.google_sql_database_instance.instance: Still creating... [30s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:45:19+07:00 logger.go:66: module.test_sql_database_instance_private_ip.google_sql_database_instance.instance: Still creating... [40s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:45:29+07:00 logger.go:66: module.test_sql_database_instance_private_ip.google_sql_database_instance.instance: Still creating... [50s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:45:39+07:00 logger.go:66: module.test_sql_database_instance_private_ip.google_sql_database_instance.instance: Still creating... [1m0s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:45:49+07:00 logger.go:66: module.test_sql_database_instance_private_ip.google_sql_database_instance.instance: Still creating... [1m10s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:45:59+07:00 logger.go:66: module.test_sql_database_instance_private_ip.google_sql_database_instance.instance: Still creating... [1m20s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:46:09+07:00 logger.go:66: module.test_sql_database_instance_private_ip.google_sql_database_instance.instance: Still creating... [1m30s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:46:19+07:00 logger.go:66: module.test_sql_database_instance_private_ip.google_sql_database_instance.instance: Still creating... [1m40s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:46:29+07:00 logger.go:66: module.test_sql_database_instance_private_ip.google_sql_database_instance.instance: Still creating... [1m50s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:46:39+07:00 logger.go:66: module.test_sql_database_instance_private_ip.google_sql_database_instance.instance: Still creating... [2m0s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:46:49+07:00 logger.go:66: module.test_sql_database_instance_private_ip.google_sql_database_instance.instance: Still creating... [2m10s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:46:59+07:00 logger.go:66: module.test_sql_database_instance_private_ip.google_sql_database_instance.instance: Still creating... [2m20s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:47:09+07:00 logger.go:66: module.test_sql_database_instance_private_ip.google_sql_database_instance.instance: Still creating... [2m30s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:47:19+07:00 logger.go:66: module.test_sql_database_instance_private_ip.google_sql_database_instance.instance: Still creating... [2m40s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:47:29+07:00 logger.go:66: module.test_sql_database_instance_private_ip.google_sql_database_instance.instance: Still creating... [2m50s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:47:39+07:00 logger.go:66: module.test_sql_database_instance_private_ip.google_sql_database_instance.instance: Still creating... [3m0s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:47:49+07:00 logger.go:66: module.test_sql_database_instance_private_ip.google_sql_database_instance.instance: Still creating... [3m10s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:47:59+07:00 logger.go:66: module.test_sql_database_instance_private_ip.google_sql_database_instance.instance: Still creating... [3m20s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:48:09+07:00 logger.go:66: module.test_sql_database_instance_private_ip.google_sql_database_instance.instance: Still creating... [3m30s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:48:19+07:00 logger.go:66: module.test_sql_database_instance_private_ip.google_sql_database_instance.instance: Still creating... [3m40s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:48:29+07:00 logger.go:66: module.test_sql_database_instance_private_ip.google_sql_database_instance.instance: Still creating... [3m50s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:48:39+07:00 logger.go:66: module.test_sql_database_instance_private_ip.google_sql_database_instance.instance: Still creating... [4m0s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:48:49+07:00 logger.go:66: module.test_sql_database_instance_private_ip.google_sql_database_instance.instance: Still creating... [4m10s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:48:59+07:00 logger.go:66: module.test_sql_database_instance_private_ip.google_sql_database_instance.instance: Still creating... [4m20s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:49:09+07:00 logger.go:66: module.test_sql_database_instance_private_ip.google_sql_database_instance.instance: Still creating... [4m30s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:49:19+07:00 logger.go:66: module.test_sql_database_instance_private_ip.google_sql_database_instance.instance: Still creating... [4m40s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:49:29+07:00 logger.go:66: module.test_sql_database_instance_private_ip.google_sql_database_instance.instance: Still creating... [4m50s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:49:39+07:00 logger.go:66: module.test_sql_database_instance_private_ip.google_sql_database_instance.instance: Still creating... [5m0s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:49:49+07:00 logger.go:66: module.test_sql_database_instance_private_ip.google_sql_database_instance.instance: Still creating... [5m10s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:49:59+07:00 logger.go:66: module.test_sql_database_instance_private_ip.google_sql_database_instance.instance: Still creating... [5m20s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:50:09+07:00 logger.go:66: module.test_sql_database_instance_private_ip.google_sql_database_instance.instance: Still creating... [5m30s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:50:19+07:00 logger.go:66: module.test_sql_database_instance_private_ip.google_sql_database_instance.instance: Still creating... [5m40s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:50:29+07:00 logger.go:66: module.test_sql_database_instance_private_ip.google_sql_database_instance.instance: Still creating... [5m50s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:50:39+07:00 logger.go:66: module.test_sql_database_instance_private_ip.google_sql_database_instance.instance: Still creating... [6m0s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:50:49+07:00 logger.go:66: module.test_sql_database_instance_private_ip.google_sql_database_instance.instance: Still creating... [6m10s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:50:59+07:00 logger.go:66: module.test_sql_database_instance_private_ip.google_sql_database_instance.instance: Still creating... [6m20s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:51:09+07:00 logger.go:66: module.test_sql_database_instance_private_ip.google_sql_database_instance.instance: Still creating... [6m30s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:51:19+07:00 logger.go:66: module.test_sql_database_instance_private_ip.google_sql_database_instance.instance: Still creating... [6m40s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:51:29+07:00 logger.go:66: module.test_sql_database_instance_private_ip.google_sql_database_instance.instance: Still creating... [6m50s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:51:39+07:00 logger.go:66: module.test_sql_database_instance_private_ip.google_sql_database_instance.instance: Still creating... [7m0s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:51:49+07:00 logger.go:66: module.test_sql_database_instance_private_ip.google_sql_database_instance.instance: Still creating... [7m10s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:51:59+07:00 logger.go:66: module.test_sql_database_instance_private_ip.google_sql_database_instance.instance: Still creating... [7m20s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:52:09+07:00 logger.go:66: module.test_sql_database_instance_private_ip.google_sql_database_instance.instance: Still creating... [7m30s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:52:19+07:00 logger.go:66: module.test_sql_database_instance_private_ip.google_sql_database_instance.instance: Still creating... [7m40s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:52:29+07:00 logger.go:66: module.test_sql_database_instance_private_ip.google_sql_database_instance.instance: Still creating... [7m50s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:52:39+07:00 logger.go:66: module.test_sql_database_instance_private_ip.google_sql_database_instance.instance: Still creating... [8m0s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:52:49+07:00 logger.go:66: module.test_sql_database_instance_private_ip.google_sql_database_instance.instance: Still creating... [8m10s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:52:59+07:00 logger.go:66: module.test_sql_database_instance_private_ip.google_sql_database_instance.instance: Still creating... [8m20s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:53:09+07:00 logger.go:66: module.test_sql_database_instance_private_ip.google_sql_database_instance.instance: Still creating... [8m30s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:53:19+07:00 logger.go:66: module.test_sql_database_instance_private_ip.google_sql_database_instance.instance: Still creating... [8m40s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:53:29+07:00 logger.go:66: module.test_sql_database_instance_private_ip.google_sql_database_instance.instance: Still creating... [8m50s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:53:39+07:00 logger.go:66: module.test_sql_database_instance_private_ip.google_sql_database_instance.instance: Still creating... [9m0s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:53:49+07:00 logger.go:66: module.test_sql_database_instance_private_ip.google_sql_database_instance.instance: Still creating... [9m10s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:53:59+07:00 logger.go:66: module.test_sql_database_instance_private_ip.google_sql_database_instance.instance: Still creating... [9m20s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:54:09+07:00 logger.go:66: module.test_sql_database_instance_private_ip.google_sql_database_instance.instance: Still creating... [9m30s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:54:19+07:00 logger.go:66: module.test_sql_database_instance_private_ip.google_sql_database_instance.instance: Still creating... [9m40s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:54:29+07:00 logger.go:66: module.test_sql_database_instance_private_ip.google_sql_database_instance.instance: Still creating... [9m50s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:54:39+07:00 logger.go:66: module.test_sql_database_instance_private_ip.google_sql_database_instance.instance: Still creating... [10m0s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:54:49+07:00 logger.go:66: module.test_sql_database_instance_private_ip.google_sql_database_instance.instance: Still creating... [10m10s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:54:59+07:00 logger.go:66: module.test_sql_database_instance_private_ip.google_sql_database_instance.instance: Still creating... [10m20s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:55:09+07:00 logger.go:66: module.test_sql_database_instance_private_ip.google_sql_database_instance.instance: Still creating... [10m30s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:55:19+07:00 logger.go:66: module.test_sql_database_instance_private_ip.google_sql_database_instance.instance: Still creating... [10m40s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:55:29+07:00 logger.go:66: module.test_sql_database_instance_private_ip.google_sql_database_instance.instance: Still creating... [10m50s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:55:39+07:00 logger.go:66: module.test_sql_database_instance_private_ip.google_sql_database_instance.instance: Still creating... [11m0s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:55:49+07:00 logger.go:66: module.test_sql_database_instance_private_ip.google_sql_database_instance.instance: Still creating... [11m10s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:55:59+07:00 logger.go:66: module.test_sql_database_instance_private_ip.google_sql_database_instance.instance: Still creating... [11m20s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:56:09+07:00 logger.go:66: module.test_sql_database_instance_private_ip.google_sql_database_instance.instance: Still creating... [11m30s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:56:19+07:00 logger.go:66: module.test_sql_database_instance_private_ip.google_sql_database_instance.instance: Still creating... [11m40s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:56:29+07:00 logger.go:66: module.test_sql_database_instance_private_ip.google_sql_database_instance.instance: Still creating... [11m50s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:56:39+07:00 logger.go:66: module.test_sql_database_instance_private_ip.google_sql_database_instance.instance: Still creating... [12m0s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:56:49+07:00 logger.go:66: module.test_sql_database_instance_private_ip.google_sql_database_instance.instance: Still creating... [12m10s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:56:59+07:00 logger.go:66: module.test_sql_database_instance_private_ip.google_sql_database_instance.instance: Still creating... [12m20s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:57:09+07:00 logger.go:66: module.test_sql_database_instance_private_ip.google_sql_database_instance.instance: Still creating... [12m30s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:57:19+07:00 logger.go:66: module.test_sql_database_instance_private_ip.google_sql_database_instance.instance: Still creating... [12m40s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:57:29+07:00 logger.go:66: module.test_sql_database_instance_private_ip.google_sql_database_instance.instance: Still creating... [12m50s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:57:39+07:00 logger.go:66: module.test_sql_database_instance_private_ip.google_sql_database_instance.instance: Still creating... [13m0s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:57:49+07:00 logger.go:66: module.test_sql_database_instance_private_ip.google_sql_database_instance.instance: Still creating... [13m10s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:57:59+07:00 logger.go:66: module.test_sql_database_instance_private_ip.google_sql_database_instance.instance: Still creating... [13m20s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:58:09+07:00 logger.go:66: module.test_sql_database_instance_private_ip.google_sql_database_instance.instance: Still creating... [13m30s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:58:19+07:00 logger.go:66: module.test_sql_database_instance_private_ip.google_sql_database_instance.instance: Still creating... [13m40s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:58:29+07:00 logger.go:66: module.test_sql_database_instance_private_ip.google_sql_database_instance.instance: Still creating... [13m50s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:58:39+07:00 logger.go:66: module.test_sql_database_instance_private_ip.google_sql_database_instance.instance: Still creating... [14m0s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:58:49+07:00 logger.go:66: module.test_sql_database_instance_private_ip.google_sql_database_instance.instance: Still creating... [14m10s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:58:53+07:00 logger.go:66: module.test_sql_database_instance_private_ip.google_sql_database_instance.instance: Creation complete after 14m14s [id=sql-instance-b3414ece]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:58:53+07:00 logger.go:66: module.test_sql_database.google_sql_database.database: Creating...
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:58:53+07:00 logger.go:66: module.test_sql_user.google_sql_user.users: Creating...
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:58:58+07:00 logger.go:66: module.test_sql_database.google_sql_database.database: Creation complete after 5s [id=projects/test-terraform-project-01/instances/sql-instance-b3414ece/databases/db-first]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:01+07:00 logger.go:66: module.test_sql_user.google_sql_user.users: Creation complete after 9s [id=sql-user/localhost/sql-instance-b3414ece]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:01+07:00 logger.go:66:
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:01+07:00 logger.go:66: Apply complete! Resources: 8 added, 0 changed, 0 destroyed.
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:01+07:00 logger.go:66:
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:01+07:00 logger.go:66: Outputs:
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:01+07:00 logger.go:66:
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:01+07:00 logger.go:66: random_string = "136bb7b139c97aab6da967ac"
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:01+07:00 logger.go:66: test_sql_database_id = "projects/test-terraform-project-01/instances/sql-instance-b3414ece/databases/db-first"
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:01+07:00 logger.go:66: test_sql_database_instance_private_ip_connection_name = "test-terraform-project-01:asia-southeast2:sql-instance-b3414ece"
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:01+07:00 logger.go:66: test_sql_database_instance_private_ip_first_ip_address = "10.53.0.3"
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:01+07:00 logger.go:66: test_sql_database_instance_private_ip_instance_name = "sql-instance-b3414ece"
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:01+07:00 logger.go:66: test_sql_database_instance_private_ip_private_ip_address = "10.53.0.3"
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:01+07:00 logger.go:66: test_sql_database_instance_private_ip_public_ip_address = ""
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:01+07:00 logger.go:66: test_sql_database_instance_private_ip_self_link = "https://sqladmin.googleapis.com/sql/v1beta4/projects/test-terraform-project-01/instances/sql-instance-b3414ece"
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:01+07:00 logger.go:66: test_sql_database_instance_private_ip_service_account_email_address = "p434072338061-w060ae@gcp-sa-cloud-sql.iam.gserviceaccount.com"
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:01+07:00 logger.go:66: test_sql_database_self_link = "https://sqladmin.googleapis.com/sql/v1beta4/projects/test-terraform-project-01/instances/sql-instance-b3414ece/databases/db-first"
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:01+07:00 logger.go:66: test_sql_user_name = "sql-user"
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:01+07:00 logger.go:66: test_sql_user_password = <sensitive>
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:01+07:00 retry.go:91: terraform [output -no-color -json random_string]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:01+07:00 logger.go:66: Running command terraform with args [output -no-color -json random_string]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:02+07:00 logger.go:66: "136bb7b139c97aab6da967ac"
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:02+07:00 retry.go:91: terraform [output -no-color -json test_sql_database_instance_private_ip_instance_name]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:02+07:00 logger.go:66: Running command terraform with args [output -no-color -json test_sql_database_instance_private_ip_instance_name]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:02+07:00 logger.go:66: "sql-instance-b3414ece"
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:02+07:00 retry.go:91: terraform [output -no-color -json test_sql_database_instance_private_ip_self_link]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:02+07:00 logger.go:66: Running command terraform with args [output -no-color -json test_sql_database_instance_private_ip_self_link]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:02+07:00 logger.go:66: "https://sqladmin.googleapis.com/sql/v1beta4/projects/test-terraform-project-01/instances/sql-instance-b3414ece"
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:02+07:00 retry.go:91: terraform [output -no-color -json test_sql_database_instance_private_ip_service_account_email_address]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:02+07:00 logger.go:66: Running command terraform with args [output -no-color -json test_sql_database_instance_private_ip_service_account_email_address]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:03+07:00 logger.go:66: "p434072338061-w060ae@gcp-sa-cloud-sql.iam.gserviceaccount.com"
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:03+07:00 retry.go:91: terraform [output -no-color -json test_sql_database_instance_private_ip_connection_name]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:03+07:00 logger.go:66: Running command terraform with args [output -no-color -json test_sql_database_instance_private_ip_connection_name]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:03+07:00 logger.go:66: "test-terraform-project-01:asia-southeast2:sql-instance-b3414ece"
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:03+07:00 retry.go:91: terraform [output -no-color -json test_sql_user_name]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:03+07:00 logger.go:66: Running command terraform with args [output -no-color -json test_sql_user_name]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:04+07:00 logger.go:66: "sql-user"
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:04+07:00 retry.go:91: terraform [output -no-color -json test_sql_database_id]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:04+07:00 logger.go:66: Running command terraform with args [output -no-color -json test_sql_database_id]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:04+07:00 logger.go:66: "projects/test-terraform-project-01/instances/sql-instance-b3414ece/databases/db-first"
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:04+07:00 retry.go:91: terraform [output -no-color -json test_sql_database_instance_private_ip_public_ip_address]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:04+07:00 logger.go:66: Running command terraform with args [output -no-color -json test_sql_database_instance_private_ip_public_ip_address]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:05+07:00 logger.go:66: ""
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:05+07:00 retry.go:91: terraform [output -no-color -json test_sql_database_instance_private_ip_private_ip_address]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:05+07:00 logger.go:66: Running command terraform with args [output -no-color -json test_sql_database_instance_private_ip_private_ip_address]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:05+07:00 logger.go:66: "10.53.0.3"
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:05+07:00 retry.go:91: terraform [destroy -auto-approve -input=false -lock=false]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:05+07:00 logger.go:66: Running command terraform with args [destroy -auto-approve -input=false -lock=false]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:07+07:00 logger.go:66: random_id.instance_suffix: Refreshing state... [id=s0FOzg]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:07+07:00 logger.go:66: random_id.random_string: Refreshing state... [id=E2u3sTnJeqttqWes]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:07+07:00 logger.go:66: module.google_compute_network_private_network.google_compute_network.vpc_network: Refreshing state... [id=projects/test-terraform-project-01/global/networks/private-network]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:08+07:00 logger.go:66: module.google_compute_global_address_private_ip_address.google_compute_global_address.default_network: Refreshing state... [id=projects/test-terraform-project-01/global/addresses/private-ip-address]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:08+07:00 logger.go:66: module.google_service_networking_connection_private_vpc_connection.google_service_networking_connection.network: Refreshing state... [id=projects%2Ftest-terraform-project-01%2Fglobal%2Fnetworks%2Fprivate-network:servicenetworking.googleapis.com]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:11+07:00 logger.go:66: module.test_sql_database_instance_private_ip.google_sql_database_instance.instance: Refreshing state... [id=sql-instance-b3414ece]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:11+07:00 logger.go:66: module.test_sql_database.google_sql_database.database: Refreshing state... [id=projects/test-terraform-project-01/instances/sql-instance-b3414ece/databases/db-first]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:11+07:00 logger.go:66: module.test_sql_user.google_sql_user.users: Refreshing state... [id=sql-user/localhost/sql-instance-b3414ece]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66: Terraform used the selected providers to generate the following execution
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66: plan. Resource actions are indicated with the following symbols:
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:   - destroy
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66: Terraform will perform the following actions:
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:   # random_id.instance_suffix will be destroyed
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:   - resource "random_id" "instance_suffix" {
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:       - b64_std     = "s0FOzg==" -> null
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:       - b64_url     = "s0FOzg" -> null
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:       - byte_length = 4 -> null
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:       - dec         = "3007401678" -> null
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:       - hex         = "b3414ece" -> null
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:       - id          = "s0FOzg" -> null
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:     }
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:   # random_id.random_string will be destroyed
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:   - resource "random_id" "random_string" {
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:       - b64_std     = "E2u3sTnJeqttqWes" -> null
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:       - b64_url     = "E2u3sTnJeqttqWes" -> null
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:       - byte_length = 12 -> null
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:       - dec         = "6010437711608382026307692460" -> null
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:       - hex         = "136bb7b139c97aab6da967ac" -> null
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:       - id          = "E2u3sTnJeqttqWes" -> null
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:     }
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:   # module.google_compute_global_address_private_ip_address.google_compute_global_address.default_network will be destroyed
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:   - resource "google_compute_global_address" "default_network" {
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:       - address            = "10.53.0.0" -> null
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:       - address_type       = "INTERNAL" -> null
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:       - creation_timestamp = "2022-03-21T10:43:41.091-07:00" -> null
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:       - id                 = "projects/test-terraform-project-01/global/addresses/private-ip-address" -> null
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:       - name               = "private-ip-address" -> null
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:       - network            = "https://www.googleapis.com/compute/v1/projects/test-terraform-project-01/global/networks/private-network" -> null
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:       - prefix_length      = 16 -> null
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:       - project            = "test-terraform-project-01" -> null
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:       - purpose            = "VPC_PEERING" -> null
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:       - self_link          = "https://www.googleapis.com/compute/v1/projects/test-terraform-project-01/global/addresses/private-ip-address" -> null
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:     }
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:   # module.google_compute_network_private_network.google_compute_network.vpc_network will be destroyed
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:   - resource "google_compute_network" "vpc_network" {
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:       - auto_create_subnetworks         = true -> null
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:       - delete_default_routes_on_create = false -> null
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:       - id                              = "projects/test-terraform-project-01/global/networks/private-network" -> null
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:       - mtu                             = 0 -> null
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:       - name                            = "private-network" -> null
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:       - project                         = "test-terraform-project-01" -> null
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:       - routing_mode                    = "REGIONAL" -> null
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:       - self_link                       = "https://www.googleapis.com/compute/v1/projects/test-terraform-project-01/global/networks/private-network" -> null
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:     }
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:   # module.google_service_networking_connection_private_vpc_connection.google_service_networking_connection.network will be destroyed
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:   - resource "google_service_networking_connection" "network" {
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:       - id                      = "projects%2Ftest-terraform-project-01%2Fglobal%2Fnetworks%2Fprivate-network:servicenetworking.googleapis.com" -> null
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:       - network                 = "projects/test-terraform-project-01/global/networks/private-network" -> null
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:       - peering                 = "servicenetworking-googleapis-com" -> null
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:       - reserved_peering_ranges = [
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:           - "private-ip-address",
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:         ] -> null
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:       - service                 = "servicenetworking.googleapis.com" -> null
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:     }
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:   # module.test_sql_database.google_sql_database.database will be destroyed
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:   - resource "google_sql_database" "database" {
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:       - charset   = "utf8mb4" -> null
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:       - collation = "utf8mb4_0900_ai_ci" -> null
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:       - id        = "projects/test-terraform-project-01/instances/sql-instance-b3414ece/databases/db-first" -> null
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:       - instance  = "sql-instance-b3414ece" -> null
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:       - name      = "db-first" -> null
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:       - project   = "test-terraform-project-01" -> null
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:       - self_link = "https://sqladmin.googleapis.com/sql/v1beta4/projects/test-terraform-project-01/instances/sql-instance-b3414ece/databases/db-first" -> null
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:     }
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:   # module.test_sql_database_instance_private_ip.google_sql_database_instance.instance will be destroyed
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:   - resource "google_sql_database_instance" "instance" {
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:       - connection_name               = "test-terraform-project-01:asia-southeast2:sql-instance-b3414ece" -> null
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:       - database_version              = "MYSQL_8_0" -> null
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:       - deletion_protection           = false -> null
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:       - first_ip_address              = "10.53.0.3" -> null
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:       - id                            = "sql-instance-b3414ece" -> null
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:       - ip_address                    = [
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:           - {
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:               - ip_address     = "10.53.0.3"
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:               - time_to_retire = ""
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:               - type           = "PRIVATE"
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:             },
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:         ] -> null
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:       - name                          = "sql-instance-b3414ece" -> null
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:       - private_ip_address            = "10.53.0.3" -> null
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:       - project                       = "test-terraform-project-01" -> null
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:       - region                        = "asia-southeast2" -> null
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:       - self_link                     = "https://sqladmin.googleapis.com/sql/v1beta4/projects/test-terraform-project-01/instances/sql-instance-b3414ece" -> null
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:       - server_ca_cert                = [
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:           - {
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:               - cert             = <<-EOT
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:                     -----BEGIN CERTIFICATE-----
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:                     MIIDfzCCAmegAwIBAgIBADANBgkqhkiG9w0BAQsFADB3MS0wKwYDVQQuEyQzY2Nh
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:                     OTMxNS1lNTQ1LTQ0YzktYTY1Zi01NGM5ZjI2ZjcyYTMxIzAhBgNVBAMTGkdvb2ds
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:                     ZSBDbG91ZCBTUUwgU2VydmVyIENBMRQwEgYDVQQKEwtHb29nbGUsIEluYzELMAkG
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:                     A1UEBhMCVVMwHhcNMjIwMzIxMTc0NjUwWhcNMzIwMzE4MTc0NzUwWjB3MS0wKwYD
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:                     VQQuEyQzY2NhOTMxNS1lNTQ1LTQ0YzktYTY1Zi01NGM5ZjI2ZjcyYTMxIzAhBgNV
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:                     BAMTGkdvb2dsZSBDbG91ZCBTUUwgU2VydmVyIENBMRQwEgYDVQQKEwtHb29nbGUs
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:                     IEluYzELMAkGA1UEBhMCVVMwggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEKAoIB
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:                     AQCJ49r31ggahDgzD7PePAgmJxvH0iYmOJcJPzvWB4TMwumG544/1a5BW5QbVIAX
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:                     S3J7t3c79dmMfD2ZRPXe/b11godVJhuJExfAahFEmmohWhGQ78B0+Hn524wXiEht
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:                     rPDilefWodtvNxGxHJo4QSeP132lq8a0/0LgpCNK7HE8ziWURzbYdUVtlwRNNq3u
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:                     WVji1JxfzRBMxcpoYpuffLE7T1DomoNm8nQQh/ps6X1uw04tjQW80VLul7bVrNKH
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:                     cIv4I6j6RmfGcB7u6bTnRzvgDBgjx3TOFMfd+ugKuvEfoPUmgoCH3Q2p/o2KQXnN
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:                     6iYvIt2+pdW6x2pWs9V7oolvAgMBAAGjFjAUMBIGA1UdEwEB/wQIMAYBAf8CAQAw
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:                     DQYJKoZIhvcNAQELBQADggEBACW5YyCCMYkyGem5zQAWoEQYhvxcFLZqYTHlPc85
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:                     3jfkR03YIRCwZ5RzsPtBuOFQ93st7lcIA+nPvrl+Y3GI/Zlb2p1ejIlf5txOtX8z
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:                     yIPvXn4aXvmpFJFlycRTyAXICHw3MMrGDw8CDbcrgcJlSV6dH08QDp4F6HzjvwG2
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:                     02Un5slJ1OWFzCLUQPeBdBj7PqDFLTOnaXXOIOyJq590t+FTjteBY4LkUI+lBGB2
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:                     GPj6QDJkVQkz9g6zp58vqfE0hqAPDqL1jCTBlqJtg/kT+U+bcmN5ta2KGYM4qw4n
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:                     y9IcbFRs7rtwQqQItuoimcaOGvba+9FT39yMuExo8KzTeQ8=
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:                     -----END CERTIFICATE-----
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:                 EOT
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:               - common_name      = "C=US,O=Google\\, Inc,CN=Google Cloud SQL Server CA,dnQualifier=3cca9315-e545-44c9-a65f-54c9f26f72a3"
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:               - create_time      = "2022-03-21T17:46:50.818Z"
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:               - expiration_time  = "2032-03-18T17:47:50.818Z"
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:               - sha1_fingerprint = "3b89eda18502db60d12f4c13a681840b453b1e11"
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:             },
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:         ] -> null
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:       - service_account_email_address = "p434072338061-w060ae@gcp-sa-cloud-sql.iam.gserviceaccount.com" -> null
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:       - settings {
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:           - activation_policy     = "ALWAYS" -> null
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:           - availability_type     = "ZONAL" -> null
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:           - disk_autoresize       = true -> null
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:           - disk_autoresize_limit = 20 -> null
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:           - disk_size             = 10 -> null
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:           - disk_type             = "PD_SSD" -> null
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:           - pricing_plan          = "PER_USE" -> null
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:           - tier                  = "db-f1-micro" -> null
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:           - user_labels           = {} -> null
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:           - version               = 1 -> null
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:           - backup_configuration {
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:               - binary_log_enabled             = true -> null
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:               - enabled                        = true -> null
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:               - point_in_time_recovery_enabled = false -> null
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:               - start_time                     = "10:00" -> null
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:               - transaction_log_retention_days = 7 -> null
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:               - backup_retention_settings {
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:                   - retained_backups = 7 -> null
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:                   - retention_unit   = "COUNT" -> null
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:                 }
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:             }
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:           - ip_configuration {
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:               - ipv4_enabled    = false -> null
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:               - private_network = "projects/test-terraform-project-01/global/networks/private-network" -> null
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:               - require_ssl     = true -> null
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:             }
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:           - location_preference {
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:               - zone = "asia-southeast2-b" -> null
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:             }
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:         }
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:     }
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:   # module.test_sql_user.google_sql_user.users will be destroyed
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:   - resource "google_sql_user" "users" {
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:       - host     = "localhost" -> null
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:       - id       = "sql-user/localhost/sql-instance-b3414ece" -> null
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:       - instance = "sql-instance-b3414ece" -> null
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:       - name     = "sql-user" -> null
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:       - password = (sensitive value)
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:       - project  = "test-terraform-project-01" -> null
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:     }
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66: Plan: 0 to add, 0 to change, 8 to destroy.
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66: Changes to Outputs:
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:   - random_string                                                       = "136bb7b139c97aab6da967ac" -> null
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:   - test_sql_database_id                                                = "projects/test-terraform-project-01/instances/sql-instance-b3414ece/databases/db-first" -> null
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:   - test_sql_database_instance_private_ip_connection_name               = "test-terraform-project-01:asia-southeast2:sql-instance-b3414ece" -> null
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:   - test_sql_database_instance_private_ip_first_ip_address              = "10.53.0.3" -> null
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:   - test_sql_database_instance_private_ip_instance_name                 = "sql-instance-b3414ece" -> null
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:   - test_sql_database_instance_private_ip_private_ip_address            = "10.53.0.3" -> null
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:   - test_sql_database_instance_private_ip_self_link                     = "https://sqladmin.googleapis.com/sql/v1beta4/projects/test-terraform-project-01/instances/sql-instance-b3414ece" -> null
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:   - test_sql_database_instance_private_ip_service_account_email_address = "p434072338061-w060ae@gcp-sa-cloud-sql.iam.gserviceaccount.com" -> null
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:   - test_sql_database_self_link                                         = "https://sqladmin.googleapis.com/sql/v1beta4/projects/test-terraform-project-01/instances/sql-instance-b3414ece/databases/db-first" -> null
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:   - test_sql_user_name                                                  = "sql-user" -> null
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66:   - test_sql_user_password                                              = (sensitive value)
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66: module.test_sql_database.google_sql_database.database: Destroying... [id=projects/test-terraform-project-01/instances/sql-instance-b3414ece/databases/db-first]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:44+07:00 logger.go:66: module.test_sql_user.google_sql_user.users: Destroying... [id=sql-user/localhost/sql-instance-b3414ece]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:47+07:00 logger.go:66: module.test_sql_user.google_sql_user.users: Destruction complete after 3s
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:48+07:00 logger.go:66: random_id.random_string: Destroying... [id=E2u3sTnJeqttqWes]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:48+07:00 logger.go:66: random_id.random_string: Destruction complete after 0s
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:49+07:00 logger.go:66: module.test_sql_database.google_sql_database.database: Destruction complete after 4s
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:49+07:00 logger.go:66: module.test_sql_database_instance_private_ip.google_sql_database_instance.instance: Destroying... [id=sql-instance-b3414ece]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T00:59:59+07:00 logger.go:66: module.test_sql_database_instance_private_ip.google_sql_database_instance.instance: Still destroying... [id=sql-instance-b3414ece, 10s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T01:00:09+07:00 logger.go:66: module.test_sql_database_instance_private_ip.google_sql_database_instance.instance: Still destroying... [id=sql-instance-b3414ece, 20s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T01:00:19+07:00 logger.go:66: module.test_sql_database_instance_private_ip.google_sql_database_instance.instance: Still destroying... [id=sql-instance-b3414ece, 30s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T01:00:29+07:00 logger.go:66: module.test_sql_database_instance_private_ip.google_sql_database_instance.instance: Still destroying... [id=sql-instance-b3414ece, 40s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T01:00:39+07:00 logger.go:66: module.test_sql_database_instance_private_ip.google_sql_database_instance.instance: Still destroying... [id=sql-instance-b3414ece, 50s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T01:00:49+07:00 logger.go:66: module.test_sql_database_instance_private_ip.google_sql_database_instance.instance: Still destroying... [id=sql-instance-b3414ece, 1m0s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T01:00:59+07:00 logger.go:66: module.test_sql_database_instance_private_ip.google_sql_database_instance.instance: Still destroying... [id=sql-instance-b3414ece, 1m10s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T01:01:01+07:00 logger.go:66: module.test_sql_database_instance_private_ip.google_sql_database_instance.instance: Destruction complete after 1m12s
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T01:01:01+07:00 logger.go:66: module.google_service_networking_connection_private_vpc_connection.google_service_networking_connection.network: Destroying... [id=projects%2Ftest-terraform-project-01%2Fglobal%2Fnetworks%2Fprivate-network:servicenetworking.googleapis.com]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T01:01:01+07:00 logger.go:66: random_id.instance_suffix: Destroying... [id=s0FOzg]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T01:01:01+07:00 logger.go:66: random_id.instance_suffix: Destruction complete after 0s
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T01:01:11+07:00 logger.go:66: module.google_service_networking_connection_private_vpc_connection.google_service_networking_connection.network: Still destroying... [id=projects%2Ftest-terraform-project-01%2F...twork:servicenetworking.googleapis.com, 10s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T01:01:21+07:00 logger.go:66: module.google_service_networking_connection_private_vpc_connection.google_service_networking_connection.network: Still destroying... [id=projects%2Ftest-terraform-project-01%2F...twork:servicenetworking.googleapis.com, 20s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T01:01:31+07:00 logger.go:66: module.google_service_networking_connection_private_vpc_connection.google_service_networking_connection.network: Still destroying... [id=projects%2Ftest-terraform-project-01%2F...twork:servicenetworking.googleapis.com, 30s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T01:01:34+07:00 logger.go:66: module.google_service_networking_connection_private_vpc_connection.google_service_networking_connection.network: Destruction complete after 34s
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T01:01:34+07:00 logger.go:66: module.google_compute_global_address_private_ip_address.google_compute_global_address.default_network: Destroying... [id=projects/test-terraform-project-01/global/addresses/private-ip-address]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T01:01:44+07:00 logger.go:66: module.google_compute_global_address_private_ip_address.google_compute_global_address.default_network: Still destroying... [id=projects/test-terraform-project-01/global/addresses/private-ip-address, 10s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T01:01:46+07:00 logger.go:66: module.google_compute_global_address_private_ip_address.google_compute_global_address.default_network: Destruction complete after 12s
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T01:01:46+07:00 logger.go:66: module.google_compute_network_private_network.google_compute_network.vpc_network: Destroying... [id=projects/test-terraform-project-01/global/networks/private-network]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T01:01:56+07:00 logger.go:66: module.google_compute_network_private_network.google_compute_network.vpc_network: Still destroying... [id=projects/test-terraform-project-01/global/networks/private-network, 10s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T01:02:06+07:00 logger.go:66: module.google_compute_network_private_network.google_compute_network.vpc_network: Still destroying... [id=projects/test-terraform-project-01/global/networks/private-network, 20s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T01:02:16+07:00 logger.go:66: module.google_compute_network_private_network.google_compute_network.vpc_network: Still destroying... [id=projects/test-terraform-project-01/global/networks/private-network, 30s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T01:02:26+07:00 logger.go:66: module.google_compute_network_private_network.google_compute_network.vpc_network: Still destroying... [id=projects/test-terraform-project-01/global/networks/private-network, 40s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T01:02:36+07:00 logger.go:66: module.google_compute_network_private_network.google_compute_network.vpc_network: Still destroying... [id=projects/test-terraform-project-01/global/networks/private-network, 50s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T01:02:46+07:00 logger.go:66: module.google_compute_network_private_network.google_compute_network.vpc_network: Still destroying... [id=projects/test-terraform-project-01/global/networks/private-network, 1m0s elapsed]
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T01:02:50+07:00 logger.go:66: module.google_compute_network_private_network.google_compute_network.vpc_network: Destruction complete after 1m3s
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T01:02:50+07:00 logger.go:66:
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T01:02:50+07:00 logger.go:66: Destroy complete! Resources: 8 destroyed.
TestTerraformCreateGCPSQL/create_mysql_with_private_ip 2022-03-22T01:02:50+07:00 logger.go:66:
--- PASS: TestTerraformCreateGCPSQL (2165.53s)
    --- PASS: TestTerraformCreateGCPSQL/create_mysql_with_public_ip (961.31s)
    --- PASS: TestTerraformCreateGCPSQL/create_mysql_with_private_ip (1204.22s)
PASS
ok  	github.com/honestbank/terraform-gcp-sql	2166.218s
</details>